       identification division.
       program-id. Project1.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.
       
       end program Program1.